
var dataStr = "1, 一<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
2, 二<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
3, 三<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
4, 四<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
5, 五<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
6, 六<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
7, 七<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
8, 八<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
9, 九<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
10, 十<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
11, 十一<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
12, 十二<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
13, 十三<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
14, 十四<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
15, 十五<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
<br>\
<br>\
16, 十六<br>\
<br>\
导演:皮特<br>\
编剧:福林<br>\
主演:力天<br>\
类型:动作<br>\
制片国家:每个<br>\
语言:英语<br>\
上映时间:2017<br>\
片场:144分钟<br>\
";
var data = [];
var d = dataStr.split('<br><br><br>');
for(var i = 0; i < d.length; i++){
	var c = d[i].split('<br><br>');
	data.push({
		img: c[0].replace(', ',' ')+'.jpg',
		caption: c[0].replace(/\d+\,\s/,' '),
		desc : c[1]
	});
	
	console.log(c[0].replace(', ',' ')+'.jpg');
}
